---
title: CameraInfo
classe: Autodesk.Revit.DB.CameraInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# CameraInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FarDistance { get; }` | `cameraInfo.FarDistance` | Double |
| `Double HorizontalExtent { get; }` | `cameraInfo.HorizontalExtent` | Double |
| `Boolean IsPerspective { get; }` | `cameraInfo.IsPerspective` | Boolean |
| `Boolean IsPespective { get; }` | `cameraInfo.IsPespective` | Boolean |
| `Boolean IsValidObject { get; }` | `cameraInfo.IsValidObject` | Boolean |
| `Double NearDistance { get; }` | `cameraInfo.NearDistance` | Double |
| `Double RightOffset { get; }` | `cameraInfo.RightOffset` | Double |
| `Double TargetDistance { get; }` | `cameraInfo.TargetDistance` | Double |
| `Double UpOffset { get; }` | `cameraInfo.UpOffset` | Double |
| `Double VerticalExtent { get; }` | `cameraInfo.VerticalExtent` | Double |
| `Void Dispose()` | `cameraInfo.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```